Hi @tmccombs,

thanks for taking the time to report this issue!

I used the provided details for reproducing the behavior you noticed, but did not succeed:

Terraform version is 1.7.2 and provider version is 5.50.0

```shell
❯ terraform version
Terraform v1.7.2
on linux_amd64
+ provider registry.terraform.io/hashicorp/aws v5.50.0

Your version of Terraform is out of date! The latest version
is 1.10.2. You can update by downloading from https://www.terraform.io/downloads.html
```

I removed the `scaling_config` for in the first iteration (code below), and ran a second test with the `scaling_configuration` block in place, maximum concurrency set to 2.

```hcl
resource "aws_lambda_event_source_mapping" "example" {
  event_source_arn        = "arn:aws:sqs:eu-central-1:544871327925:MyQueue"
  function_name           = "myfunctionName"
  function_response_types = ["ReportBatchItemFailures"]
}
```

No tags were set, neither on provider nor resource level. 

I created the event source mapping via `terraform apply` and ran `terraform plan` afterwards.  Latter reported no changes: 


```shell
❯ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.example will be created
  + resource "aws_lambda_event_source_mapping" "example" {
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:eu-central-1:<redacted>:MyQueue"
      + function_arn                  = (known after apply)
      + function_name                 = "myfunctionName"
      + function_response_types       = [
          + "ReportBatchItemFailures",
        ]
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_lambda_event_source_mapping.example: Creating...
aws_lambda_event_source_mapping.example: Still creating... [10s elapsed]
aws_lambda_event_source_mapping.example: Creation complete after 14s [id=75797acd-4153-43d2-af24-4d373a892568]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
❯ terraform plan
aws_lambda_event_source_mapping.example: Refreshing state... [id=75797acd-4153-43d2-af24-4d373a892568]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed
```

Maybe there is something I missed. If so, please let me know.

Additionally, let me point out that the support for `tags` and `tags_all` on the resource `aws_lambda_event_source_mapping` was added with AWS provider release 5.70 ([Pull request](https://github.com/hashicorp/terraform-provider-aws/pull/39535),  [release notes](https://github.com/hashicorp/terraform-provider-aws/releases/tag/v5.70.0), [AWS press release](https://aws.amazon.com/about-aws/whats-new/2024/09/aws-lambda-tagging-event-source-mappings-code-signing-config-resources/)). Can you try this version?
